#language: ru

Функция: Пользователь ищет инфу
  Пользователь ищет инфу про Cucumber в Яндексе

  Предыстория: открыта страница
    Дано открыта главная страница Яндекс

  Сценарий: пользователь ищет что такое Cucumber
    Когда пользователь вводит запрос "что такое cucumber"
    И нажимает Найти
    Тогда происходит скриншот
    И происходит прикрепление ссылки

  Сценарий: пользователь ищет как установить Cucumber
    Когда пользователь вводит запрос "как установить cucumber"
    И нажимает Найти

